export const monthByNumber = {
    0: '1月',
    1: '2月',
    2: '3月',
    3: '4月',
    4: '5月',
    5: '6月',
    6: '7月',
    7: '8月',
    8: '9月',
    9: '10月',
    10: '11月',
    11: '12月'
};

export const numberByMonth = {
    '1月': 0,
    '2月': 1,
    '3月': 2,
    '4月': 3,
    '5月': 4,
    '6月': 5,
    '7月': 6,
    '8月': 7,
    '9月': 8,
    '10月': 9,
    '11月': 10,
    '12月': 11
};

export const daysInMonth = {
    0: 31,
    1: 28,
    2: 31,
    3: 30,
    4: 31,
    5: 30,
    6: 31,
    7: 31,
    8: 30,
    9: 31,
    10: 30,
    11: 31
};

export const unit = {
    day: 'day',
    month: 'month',
    year: 'year'
};
